id/tentang-situs-ini/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-11-16 Wed 14:20 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Tentang Situs Ini</title>
<meta name="generator" content="Org mode">
<meta name="description" content="Situs yang saya buat sejak tahun 2021 dan sampai sekarang masih tidak ada isi yang bermanfaat."
>
<link rel="stylesheet" href="/assets/css/main.css">
                     <link rel="icon" type="image/svg+xml" href="/assets/favicon.svg">
</head>
<body>
<header id="preamble" class="status">
<h1>Tentang Situs Ini</h1> <p>16 November 2022</p> <p>Situs yang saya buat sejak tahun 2021 dan sampai sekarang masih tidak ada isi yang bermanfaat.</p>
</header>
<article id="content">

<div id="outline-container-orgb384ca9" class="outline-2">
<h2 id="orgb384ca9">Prakata</h2>
<div class="outline-text-2" id="text-orgb384ca9">
<p>
Saya adalah seorang <i>programmer</i> dari <a href="https://binaracademy.com">Binar Academy</a>, yang mana adalah sebuah perusahaan yang bergerak di bidang teknologi dan edukasi. Sebagai seorang karyawan yang mempunyai visi yang sama dengan perusahaannya, saya pun haus untuk berbagi ilmu, pengalaman, dan apapun yang saya ketahui. Baik itu di bidang teknologi, maupun bidang lainnya.
</p>

<p>
Maka dari itu, saya membentuk situs ini. Situs ini akan saya gunakan sebagai wadah untuk berekspresi, berbagi ilmu, berbagi pengalaman, dan berbagai sudut pandang saya terkait dunia saat ini. Karena dengan berbagi, secara tidak langsung saya sudah berkontribusi dalam memajukan pendidikan baik di Indonesia, maupun di dunia ini. Karena saya percaya, dengan majunya pendidikan, dunia ini akan menjadi lebih baik dengan perspektif yang lebih masuk akal.
</p>

<p>
Semua konten yang ada di situs ini adalah hasil pikiran saya seorang. Tentu saja jika saya mendapatkan informasi dari suatu sumber yang dapat saya cantumkan, saya akan memberi sitasi dengan baik. Karena saya percaya, dengan menyertakan sumber, pembaca dapat melakukan peninjauan lebih lanjut supaya informasi yang pembaca terima tidak hanya datang dari satu arah saja.
</p>
</div>
</div>

<div id="outline-container-orgdc0a68a" class="outline-2">
<h2 id="orgdc0a68a">Konten di dalam Situs ini</h2>
<div class="outline-text-2" id="text-orgdc0a68a">
<p>
Situs ini akan mencakup tulisan-tulisan saya mengenai beberapa topik berikut:
</p>
<ul class="org-ul">
<li>Komputer</li>
<li>GNU/Linux</li>
<li><i>Free and Open Source Software</i></li>
<li><i>Programming</i></li>
<li><i>Emacs</i></li>
<li>Dan lain-lain.</li>
</ul>

<p>
Topik-topik diatas adalah topik yang kebetulan saya kuasai, dan sangat saya gemari. Ada banyak hal yang bisa dikulik dari topik-topik diatas. Seperti <i>emacs</i>, saya membuat tulisan ini hanya berbekal  <i>emacs</i> saja, dan tulisan ini ditulis di dengan format <code>.org</code> dari <i>emacs</i>. Tulisan tersebut lalu dikonversi menjadi tulisan dengan format <code>html</code> oleh <i>emacs</i>. Bahkan kalau saya mau, tulisan ini pun bisa saya publikasikan dalam bentuk PDF.
</p>

<p>
Saya harap pembaca dapat menangkap gambaran besar terkait apa saja yang akan saya tulis kedepannya.
</p>
</div>
</div>

<div id="outline-container-orgec016c7" class="outline-2">
<h2 id="orgec016c7">Seberapa Sering Saya Akan Membuat Tulisan Baru?</h2>
<div class="outline-text-2" id="text-orgec016c7">
<p>
Sejujurnya, saya adalah seseorang yang sebenarnya baru saja belajar menulis, dan saya cukup senang menulis. Akan tetapi kesenangan saya tidak membuat saya lantas rajin menulis, karena saya masih ada musuh terbesar yang perlu saya hadapi, yaitu rasa malas.
</p>

<p>
Saya akan berusaha untuk menulis setiap bulannya, namun saya tidak bisa berjanji. Bahkan, saya ada tendensi untuk menghapus tulisan saya jika saya menganggap itu sampah, seperti yang pernah saya lakukan di situs ini.
</p>
</div>
</div>

<div id="outline-container-org3fe01bc" class="outline-2">
<h2 id="org3fe01bc">Situs ini Terdiri dari Apa Saja?</h2>
<div class="outline-text-2" id="text-org3fe01bc">
<p>
Seperti yang sudah saya sebutkan di muka, situs ini saya buat dengan menggunakan <i>emacs</i> saja. Untuk gaya tampilan dari situs ini saya menggunakan <a href="https://simplecss.org/">Simple.css</a>. Namun ini dapat berubah di kemudian hari.
</p>
</div>
</div>
</article>
<footer id="postamble" class="status">
<p>© 2021 Fikri Rahmat Nurhidayat</p>
</footer>
</body>
</html>
